Hexagonal/UserService/Adapters/SOAPAdapter/getAllVMs.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:vm="http://p.lodz.pl/vmachines">
    <soapenv:Header/>
    <soapenv:Body>
        <vm:getAllVMachinesRequest/>
    </soapenv:Body>
</soapenv:Envelope>
